from .info import etl, result_etl, online

words = ["纳米发电机", "纳米发电模组", "纳米传感器", "NEMS", "纳机电系统", "纳米发电薄膜", "纳米风力发电薄膜", "纳米风力发电", "纳米摩擦传感电缆", "纳米摩擦", "纳米传感电缆",
         "纳米摩擦电缆", "纳米传感带", "纳米自发电鞋", "纳米发电鞋", "压电传感器", "生理监测传感带", "生理信号采集传感带", "纳米自发电鞋",
         "自发光鞋", "智能计步鞋", "追踪鞋", "智能看护鞋", "足部理疗鞋", "自发电防伪", "高端酒防伪", "化妆品防伪", "物流防伪", "药品防伪", "纳米防伪", "微纳传感器",
         "微型能量收集", "石墨烯微型超级电容器", "石墨烯超级电容器", "石墨烯微型电容器", "石墨烯电容器", "压电传感电缆", "压电传感电缆", "纳米氧化锌", "紫外线传感器",
         "硅基紫外线传感器", "气流传感器", "气动传感（器）", "电子烟传感器", "雾化器传感器", "通用雾化器传感器", "医用雾化器传感器", "气体检测传感器", "智能睡眠传感器",
         "智能枕头传感器", "居家养老监护器", "智能床垫传感器", "智能坐垫传感器"]
cur = etl.cursor()

sql = """select title,abs,pubnumber,appdate,applicantname,appcoun from patent_{num} limit {start},{buchang}""".format()
